"""
	Автор: Гришутенко Павел, группа№1, подгруппа№2
	Сумма арифметической прогрессии
	Сумма арифмитической прогрессии от 1 до 100
	
	Задача решена с помощью формулы суммы арифметической прогрессии
	sum = (a1+an)*n/2
"""
x = (1+100)*100/2
print(x)

print(sum(list(range(101))))
